In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('D:\BCA- STUDY\Python\Datasets\Student_result.csv')
df

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50
1        1002     10          6                       2          80
2        1003     10          3                       2          60
3        1004     11          0                       1          45
4        1005     12          5                       2          75

In [3]:
df.loc[0]

Student ID                1001
Class                       10
Study hrs                    2
Social Media usage hrs       3
Percentage                  50
Name: 0, dtype: int64

In [4]:
df.loc[[0]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50

In [5]:
df.loc[[4]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
4        1005     12          5                       2          75

In [7]:
df.loc[[0,1]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50
1        1002     10          6                       2          80

In [8]:
df.loc[[2,4]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
2        1003     10          3                       2          60
4        1005     12          5                       2          75

In [9]:
df.loc[4, 'Class']

12

In [10]:
df.loc[2, 'Study hrs']

3

In [11]:
df.loc[0:3, 'Class']

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [14]:
df.loc[0:2, 'Percentage']

0    50
1    80
2    60
Name: Percentage, dtype: int64

In [20]:
df.loc[[False, False, True, False, True]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
2        1003     10          3                       2          60
4        1005     12          5                       2          75

In [21]:
df.loc[df['Class']<11]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50
1        1002     10          6                       2          80
2        1003     10          3                       2          60

In [22]:
df.loc[df['Class'] < 11, ['Percentage']]

   Percentage
0          50
1          80
2          60

In [23]:
df.loc[df['Percentage'] < 60, ['Student ID']]

   Student ID
0        1001
3        1004

In [27]:
df.iloc[0]

Student ID                1001
Class                       10
Study hrs                    2
Social Media usage hrs       3
Percentage                  50
Name: 0, dtype: int64

In [28]:
df.iloc[[0]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50

In [33]:
df.iloc[0:3]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50
1        1002     10          6                       2          80
2        1003     10          3                       2          60

In [36]:
df.iloc[[0,1]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50
1        1002     10          6                       2          80

In [38]:
df.iloc[[True, False, True, False, True]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percentage
0        1001     10          2                       3          50
2        1003     10          3                       2          60
4        1005     12          5                       2          75